/*:
@target MV MZ
@plugindesc Skill Tree Config v1.0.0
@author unagiootoro
@url https://raw.githubusercontent.com/unagiootoro/RPGMZ/master/SkillTreeConfig.js

@help
[Overview]
A plugin that introduces a skill tree.
Allows you to create skill trees where skills are acquired using SP.

[Usage]
■ Skill Tree Configuration
Edit the "SkillTreeConfig.js" file to configure skill trees.
Basic configuration involves setting skill tree types (such as sword skills or magic skills) for each actor,
and then building the skill tree for each type.
Skill trees are constructed using skill derivation settings (e.g., acquiring Fire I enables Fire II).

■ SP Acquisition Settings
SP is required to acquire skills.
There are two ways to configure SP acquisition:
・Acquisition at the end of battle
・SP acquisition through leveling up

・How to set SP gained at the end of battle
In the enemy character's note field, write:
<battleEndGainSp: SP>

・How to set SP acquisition through leveling up
Configure using "levelUpGainSp" in the config.

■ How to Gain SP in Events
In a script, write:
skt_gainSp(actorId, SP value)
This allows the specified actor to gain the designated SP.
For example, to have actor ID 1 gain 5 SP:
skt_gainSp(1, 5);

■ Getting Total Allocated SP
Write:
skt_totalSp(actorId, variableId for total SP)
This assigns the total SP allocated so far by the specified actor to the designated variable.
For example, to assign actor ID 1's total SP to variable ID 2:
skt_totalSp(1, 2);

■ Skill Reset
Write in a script:
skt_skillReset(actorId);
This allows you to reset previously acquired skills.
For example, to reset skills for actor ID 1:
skt_skillReset(1);

■ Enabling/Disabling Skill Tree Types
To enable a type, write in a script:
skt_enableType(actorId, "Type Name");

To disable a type, write:
skt_disableType(actorId, "Type Name")

Disabled types will not appear in the skill tree type list.

■ Type Migration
If you want new skills to be added to the skill tree when certain conditions are met, use "Type Migration".
For example, if you want to change the type "Lower Magic" to "Higher Magic", first register both types in the config,
and disable "Higher Magic". Then, use the type migration feature to migrate "Lower Magic" to "Higher Magic".

To perform type migration, write in a script:
skt_migrationType(actorId, "Source Type Name", "Target Type Name", resetFlag);
For the reset flag, specify true to reset the source type's skill tree after migration,
and false to not reset it.
For example, to migrate actor ID 1's "Lower Magic" to "Higher Magic" and perform a skill reset:
skt_migrationType(actorId, "Lower Magic", "Higher Magic", true);

■ Loading Skill Tree from Map
You can create skill trees with a somewhat free layout by loading the placement coordinates of each skill in the skill tree from a map.
This feature only allows you to set the coordinates of skills; the lines between skills are drawn by the plugin.

・Setting Skill Coordinates
Configure on a map event.
For example, if there is a skill called "Fire", create an empty event at the coordinates where you want to place the skill,
and write in the event's note field:
Fire
The XY coordinates of the event with "Fire" written in the note field will be used as the XY coordinates of the skill.

■ Launching Skill Tree from Script
Write in a script:
skt_open(actorId);
This allows you to launch the skill tree for the specified actor.
*/

const loadSkillTreeConfig = () => {
return {
// =============================================================
// ●ここからは設定項目です。
// =============================================================

// スキルツリーのタイプの設定を行います。
// skillTreeTypes: [ ～ ]の中にアクターの数だけタイプ設定を追加します。

// タイプ設定は、次の形式で設定します。
// { actorId: アクターのID, types: [タイプ情報1, タイプ情報2, ...] }

// タイプ情報は、次の形式で設定します。
// [タイプ種別, タイプ名, タイプの説明, タイプ有効/無効]
// タイプ種別...スキルの派生設定でタイプを識別するためのユニークな識別子を設定します。
// タイプ名...タイプ一覧のウィンドウに表示するタイプ名を設定します。
// タイプの説明...タイプ一覧のウィンドウに表示するタイプの説明を設定します。
// タイプ有効/無効...タイプを有効にする場合は、trueを、無効にする場合は、falseを指定します。
//                  この項目については、省略可能です。省略した場合、trueが指定されます。
skillTreeTypes: [
    {
        actorId: 1,
        types: [
            ["ナズナ１", "Hakutou Swordsmanship", "Hakutou sword techniques are useful under any circumstances."],
            ["ナズナ２", "Youko Blood", "Unleashes her power as an anomaly to strengthen her physical body."],
        ]
    },

    {
        actorId: 2,
        types: [
            ["プリム１", "Boardroom Strategy", "Dispatches enemies quickly using strategic greatsword techniques."],
            ["プリム２", "Maid Protection Arts", "By acting as a shield to protect her allies, she gets to slack off on attacking."],
        ]
    },

    {
        actorId: 3,
        types: [
            ["桜悳１", "Ryuuzenzan Mystic Law", "By applying soul arts, one can borrow nature's power."],
            ["桜悳２", "Daibyou's Enlightenment", "By following the path of enlightenment, even instincts can be controlled."],
        ]
    },

    {
        actorId: 4,
        types: [
            ["ウーラ１", "Laborer Life", "Grateful for daily labor, she masters reliable techniques."],
            ["ウーラ２", "Modest Hobby", "She attempts to put mechanical tinkering to use in battle."],
        ]
    },

    {
        actorId: 5,
        types: [
            ["杖１", "Saeishuu Ninjutsu", "Use shinobi techniques to gain an advantage in combat."],
            ["杖２", "Serpent of the Night's Shade", "The serpent's poison and cold afflict those who oppose."],
        ]
    },

    {
        actorId: 6,
        types: [
            ["存子１", "Yori Inugami", "Exerts her power as a Shikon Kaii to torment her enemies."],
            ["存子２", "Drunken Old Bake-danuki", "Allows her to drink sake while fighting, making it quite advantageous."],
        ]
    },

    {
        actorId: 7,
        types: [
            ["淡雪１", "陣頭指揮", "先頭に立ち、隊を勝利へと導きます。"],
            ["淡雪２", "将の右腕", "裏方に徹し、確実な勝利を収めます。"],
        ]
    },

    {
        actorId: 8,
        types: [
            ["夕闇１", "五尾夕闇", "四魂怪異としての力を発揮し、敵を焼き尽くします。"],
            ["夕闇２", "妖艶妖狐", "艶やかな魅力を存分に見せつけていきます。"],
        ]
    },
],

// スキルツリーのマップ読み込み設定を行います。
// 読み込むマップは以下の形式で指定します。
// skillTreeMapId: { skillTreeName1: mapID1, skillTreeName2: mapID2, ... }
// skillTreeName...スキルツリーのタイプ名を指定します。
// mapID...読み込むマップIDを指定します。0の場合は読み込みを行いません。
skillTreeMapId: {
    "ナズナ１": 9,
    "ナズナ２": 10,
    "プリム１": 3,
    "プリム２": 4,
    "桜悳１": 5,
    "桜悳２": 6,
    "ウーラ１": 7,
    "ウーラ２": 8,
    "杖１": 11,
    "杖２": 12,
    "存子１": 14,
    "存子２": 13,
    "淡雪１": 361,
    "淡雪２": 362,
    "夕闇１": 363,
    "夕闇２": 364,
},

// 各スキルの情報を登録します。
// skillTreeInfo: [ ～ ]の中に登録するスキル数分のスキル情報の登録を行います。

// スキル情報の登録は次の形式で行います。
// [スキル名, スキルID, 必要SP, アイコン情報]
// スキル名...スキルツリーの派生設定でスキルを一意に識別するための識別子
//            識別子なので、実際のスキル名と一致していなくても問題はありません。
// スキルID...データベース上で該当するスキルのID
// 必要SP...スキルの習得に必要なSP
// アイコン情報については、アイコンを使用するか、任意の画像を使用するかに応じて次の形式で登録します。
//   アイコンを使用する場合 ["icon", iconIndex]
//   iconIndex...使用するアイコンのインデックス
//               iconIndexは省略可能です。省略した場合、スキルに設定されているアイコンが使用されます。
//   画像を使用する場合 ["img", fileName]
//   fileName...画像のファイル名。画像は、「img/pictures」フォルダにインポートしてください。
// なお、アイコン情報については省略可能です。省略した場合、["icon"]が適用されます。
skillTreeInfo: [
    // ナズナ
    ["朱ノ盃", 21, 4],
    ["神楽鈴", 22, 4],
    ["徒手掌打", 24, 2],
    ["滾々脚", 25, 4],
    ["烈火赤日", 26, 6],
    ["宵ノ辻", 27, 2],
    ["狐炎剣", 28, 5],
    ["疾風", 29, 2],
    ["上風", 30, 8],
    ["孤月", 31, 4],
    ["風車", 32, 3],
    ["紅鏡", 33, 6],
    ["下風", 34, 5],
    ["晴雲秋月", 36, 10],
    ["雲外蒼天", 37, 10],
    ["基礎修練", 39, 4],
    ["妖狐覚醒Ⅰ", 40, 2],
    ["妖狐覚醒Ⅱ", 41, 4],
    ["妖狐覚醒Ⅲ", 42, 6],
    ["鋭い刃Ⅰ", 43, 2],
    ["鋭い刃Ⅱ", 44, 5],
    ["ハクトウの火Ⅰ", 45, 4],
    ["ハクトウの火Ⅱ", 46, 6],
    ["一本気Ⅰ", 47, 2],
    ["一本気Ⅱ", 48, 4],
    ["起死回生", 49, 6],
    ["神楽共鳴", 50, 6],
    ["疾風返し", 51, 8],
    ["疾風の構え", 52, 4],
    ["残心", 53, 2],

    // プリム
    ["ツークツヴァンク", 61, 2],
    ["プロモーション", 62, 4],
    ["ナイトピース", 63, 5],
    ["ルークピース", 64, 4],
    ["キャスリング", 65, 6],
    ["ディスカバード", 66, 4],
    ["ピン", 69, 2],
    ["スキュアー", 70, 4],
    ["ポーンピース", 71, 2],
    ["アンパッサン", 72, 3],
    ["ギャンビット", 73, 6],
    ["フィアンケット", 74, 4],
    ["チェック", 75, 6],
    ["クイーンピース", 77, 10],
    ["チェックメイト", 78, 10],
    ["必要な体力Ⅰ", 80, 2],
    ["必要な体力Ⅱ", 81, 4],
    ["必要な体力Ⅲ", 82, 6],
    ["動じない心Ⅰ", 83, 2],
    ["動じない心Ⅱ", 84, 4],
    ["動じない心Ⅲ", 85, 6],
    ["力仕事Ⅰ", 86, 2],
    ["力仕事Ⅱ", 87, 5],
    ["当然の資質Ⅰ", 88, 2],
    ["当然の資質Ⅱ", 89, 5],
    ["耐え忍ぶ時", 90, 4],
    ["大胆な一手", 91, 6],
    ["確かな読み", 92, 6],
    ["盤石の布陣", 93, 8],
    ["先攻にて失礼", 94, 6],

    // 桜悳
    ["帰依", 101, 4],
    ["治癒の法力", 102, 2],
    ["大願法術", 103, 8],
    ["片合掌", 104, 4],
    ["自然体", 105, 2],
    ["一切皆空", 106, 6],
    ["魂の六境", 107, 9],
    ["魂衝", 109, 4],
    ["妙法・雷鼓", 110, 3],
    ["妙法・春雷", 111, 4],
    ["妙法・凩", 112, 3],
    ["妙法・野分", 113, 4],
    ["妙法・虹", 114, 3],
    ["妙法・眩耀", 115, 4],
    ["無辺の虚空", 116, 7],
    ["大猫解放", 118, 10],
    ["無量神通風解", 119, 10],
    ["一景", 121, 2],
    ["怪異の本覚Ⅰ", 122, 2],
    ["怪異の本覚Ⅱ", 123, 4],
    ["怪異の本覚Ⅲ", 124, 6],
    ["悟りⅠ", 125, 2],
    ["悟りⅡ", 126, 4],
    ["悟りⅢ", 127, 6],
    ["寂滅Ⅰ", 128, 2],
    ["寂滅Ⅱ", 129, 4],
    ["一来", 130, 6],
    ["雷の行", 131, 5],
    ["風の行", 132, 5],
    ["光の行", 133, 5],

    // ウーラ
    ["キュアツール", 141, 2],
    ["キュアプラント", 142, 8],
    ["レイズツール", 143, 4],
    ["レイズプラント", 144, 8],
    ["ヒールクラフト", 145, 4],
    ["バトルデプロイ", 146, 4],
    ["アクセラレーター", 147, 4],
    ["パワーサポート", 148, 3],
    ["マジックサポート", 149, 3],
    ["ナチュラライズ", 150, 2],
    ["ロボットアーム", 152, 2],
    ["マシンガンセット", 153, 4],
    ["バブルシューター", 154, 4],
    ["オーラグレネード", 155, 6],
    ["オーバーワーカー", 157, 10],
    ["ハイパーボンバー", 158, 10],
    ["労働力Ⅰ", 160, 2],
    ["労働力Ⅱ", 161, 4],
    ["労働力Ⅲ", 162, 6],
    ["鬱憤解消Ⅰ", 163, 2],
    ["鬱憤解消Ⅱ", 164, 4],
    ["鬱憤解消Ⅲ", 165, 6],
    ["道具改造Ⅰ", 166, 4],
    ["道具改造Ⅱ", 167, 6],
    ["納期直前", 168, 4],
    ["労働万歳", 169, 4],
    ["残業", 170, 4],
    ["回復工作", 171, 4],
    ["ストレス", 172, 6],
    ["高速処理", 173, 6],

    // 杖
    ["救命・先手", 181, 4],
    ["救命・後手", 182, 4],
    ["救命陣", 183, 8],
    ["夜陰双身", 184, 6],
    ["誘蛾灯渡し", 185, 2],
    ["朧々幻影", 186, 5],
    ["瘴煙", 188, 4],
    ["蛇咬毒牙", 189, 6],
    ["刃解き", 190, 3],
    ["鎧解き", 191, 3],
    ["白紙術", 192, 2],
    ["夜陰襲撃", 193, 2],
    ["夜刀・氷牙", 194, 4],
    ["夜刀・斬月", 195, 6],
    ["奥義陽炎", 197, 10],
    ["百鬼陣", 198, 10],
    ["隠し刃Ⅰ", 200, 4],
    ["隠し刃Ⅱ", 201, 7],
    ["狗走Ⅰ", 202, 2],
    ["狗走Ⅱ", 203, 4],
    ["狗走Ⅲ", 204, 6],
    ["心得Ⅰ", 205, 2],
    ["心得Ⅱ", 206, 4],
    ["心得Ⅲ", 207, 6],
    ["夜行Ⅰ", 208, 2],
    ["夜行Ⅱ", 209, 4],
    ["遁走", 210, 4],
    ["深草兎歩", 211, 6],
    ["奇襲", 212, 4],
    ["空蝉", 213, 6],

    // 存子
    ["怪気練", 221, 2],
    ["怪気練練", 222, 2],
    ["怪気練練練", 223, 6],
    ["妖狸変化", 224, 8],
    ["湧酒瓢箪", 225, 2],
    ["酩酊得々", 226, 4],
    ["白霧", 228, 4],
    ["瓢箪妖打", 229, 4],
    ["八八神通力", 230, 6],
    ["妖狸玉", 231, 2],
    ["木の葉吹き", 232, 3],
    ["つむじ風", 233, 5],
    ["狸囃子", 234, 6],
    ["隠神顕現", 236, 10],
    ["怪力乱神", 237, 10],
    ["継承Ⅰ", 239, 2],
    ["継承Ⅱ", 240, 4],
    ["継承Ⅲ", 241, 6],
    ["魔力炸裂Ⅰ", 242, 4],
    ["魔力炸裂Ⅱ", 243, 6],
    ["大きな尻尾Ⅰ", 244, 2],
    ["大きな尻尾Ⅱ", 245, 4],
    ["無風Ⅰ", 246, 4],
    ["無風Ⅱ", 247, 6],
    ["狸の宴Ⅰ", 248, 4],
    ["狸の宴Ⅱ", 249, 8],
    ["ぽんぽこ酔気Ⅰ", 250, 2],
    ["ぽんぽこ酔気Ⅱ", 251, 4],
    ["ぽんぽこ酔気Ⅲ", 252, 6],
    ["怪異行燈", 253, 4],

    // 淡雪
    ["救護", 801, 2],
    ["秘策", 802, 4],
    ["活性術", 803, 4],
    ["大活性術", 804, 6],
    ["力の連携", 805, 4],
    ["反転攻勢", 806, 4],
    ["事前の秘策", 807, 4],
    ["一斉攻撃", 808, 6],
    ["鈍らせの罠", 809, 6],
    ["漫ろ雨", 811, 2],
    ["雪解雨", 812, 2],
    ["冥剣", 813, 4],
    ["秘剣黒時雨", 814, 8],
    ["振り太刀", 815, 2],
    ["千切れ雲", 816, 4],
    ["決死行", 818, 10],
    ["次ぎ秘剣", 819, 10],
    ["傷狙い", 821, 4],
    ["見極めⅠ", 822, 2],
    ["見極めⅡ", 823, 4],
    ["無尽蔵Ⅰ", 824, 2],
    ["無尽蔵Ⅱ", 825, 4],
    ["熟慮Ⅰ", 826, 4],
    ["熟慮Ⅱ", 827, 6],
    ["熟慮Ⅲ", 828, 8],
    ["長期戦略Ⅰ", 829, 4],
    ["長期戦略Ⅱ", 830, 6],
    ["窮地の策", 831, 6],
    ["理解", 832, 4],
    ["秘剣の機", 833, 4],

    // 夕闇
    ["夕闇返り", 841, 2],
    ["潤い火", 842, 4],
    ["潤い火授け", 843, 6],
    ["亜魂妙命", 844, 2],
    ["亜魂妙命真価", 845, 8],
    ["尽きぬ灯火", 846, 6],
    ["妖狐魅了", 848, 2],
    ["艶尾の辻", 849, 6],
    ["娟々脚", 850, 2],
    ["包み火", 851, 4],
    ["夕火", 852, 3],
    ["夕火退廃", 853, 5],
    ["魔炎大砲", 854, 6],
    ["五尾炬火", 856, 10],
    ["亜魂妙命残火", 857, 10],
    // ["継承Ⅰ", 859, 2],
    // ["継承Ⅱ", 860, 2],
    // ["継承Ⅲ", 861, 2],
    // ["魔力炸裂Ⅰ", 862, 2],
    // ["魔力炸裂Ⅱ", 863, 2],
    ["上々Ⅰ", 864, 2],
    ["上々Ⅱ", 865, 4],
    ["健康体Ⅰ", 866, 2],
    ["健康体Ⅱ", 867, 4],
    ["夕闇時Ⅰ", 868, 4],
    ["夕闇時Ⅱ", 869, 8],
    ["高嶺の花", 870, 4],
    ["上機嫌", 871, 4],
    ["美貌", 872, 6],
    ["魅了体質", 873, 4],
],

// スキルツリーの派生設定を行います。
// skillTreeDerivative: { ～ }の中にタイプ数分のスキルツリーの登録を行います。

// スキルツリーの派生設定は次のように行います。
// "タイプ名": [ [スキル1, [派生先スキル1, 派生先スキル2, ...]], [スキル2, [派生先スキル3, 派生先スキル4, ...] ]
// ※派生先スキルが存在しない終端スキルの場合、派生先スキルは省略可能です。
//
// 例えば、"様子を見る"と"連続攻撃"を取得すると、"２回攻撃"が取得できるようにするには、次の設定を行います。
// ["様子を見る", ["２回攻撃"]],
// ["連続攻撃", ["２回攻撃"]],
// ["２回攻撃"],
//
// また、"ヒール"を取得すると、"ファイア"と"スパーク"が取得できるようにするには、次の設定を行います。
// ["ヒール", ["ファイア"]],
// ["ヒール", ["スパーク"]],
// ["ファイア"],
// ["スパーク"],
skillTreeDerivative: {
    "ナズナ１": [
        ["宵ノ辻", ["疾風"]],
        ["疾風", ["鋭い刃Ⅰ", "風車"]],
        ["鋭い刃Ⅰ", ["孤月"]],
        ["孤月", ["鋭い刃Ⅱ"]],
        ["鋭い刃Ⅱ", ["上風", "狐炎剣"]],
        ["上風", ["雲外蒼天"]],

        ["風車", ["基礎修練", "残心"]],
        ["基礎修練", ["狐炎剣"]],
        ["狐炎剣", ["紅鏡"]],
        ["紅鏡", ["雲外蒼天"]],

        ["残心", ["疾風の構え"]],
        ["疾風の構え", ["下風"]],
        ["下風", ["疾風返し"]],
        ["疾風返し", ["雲外蒼天"]],
        ["雲外蒼天"],
    ],

    "ナズナ２": [
        ["妖狐覚醒Ⅰ", ["一本気Ⅰ", "徒手掌打"]],
        ["一本気Ⅰ", ["妖狐覚醒Ⅱ"]],
        ["妖狐覚醒Ⅱ", ["一本気Ⅱ"]],
        ["一本気Ⅱ", ["妖狐覚醒Ⅲ", "烈火赤日"]],
        ["妖狐覚醒Ⅲ", ["晴雲秋月"]],

        ["徒手掌打", ["朱ノ盃", "滾々脚"]],
        ["朱ノ盃", ["神楽鈴"]],
        ["神楽鈴", ["烈火赤日"]],
        ["烈火赤日", ["神楽共鳴"]],
        ["神楽共鳴", ["晴雲秋月"]],

        ["滾々脚", ["ハクトウの火Ⅰ"]],
        ["ハクトウの火Ⅰ", ["起死回生"]],
        ["起死回生", ["ハクトウの火Ⅱ"]],
        ["ハクトウの火Ⅱ", ["晴雲秋月"]],
        ["晴雲秋月"],
    ],

    "プリム１": [
        ["ポーンピース", ["力仕事Ⅰ", "当然の資質Ⅰ"]],
        ["力仕事Ⅰ", ["アンパッサン"]],
        ["アンパッサン", ["力仕事Ⅱ"]],
        ["力仕事Ⅱ", ["ギャンビット"]],
        ["ギャンビット", ["チェックメイト"]],

        ["当然の資質Ⅰ", ["フィアンケット", "ピン"]],
        ["フィアンケット", ["ナイトピース"]],
        ["ナイトピース", ["ギャンビット", "チェック"]],
        ["チェック", ["盤石の布陣"]],
        ["盤石の布陣", ["チェックメイト"]],

        ["ピン", ["スキュアー"]],
        ["スキュアー", ["当然の資質Ⅱ"]],
        ["当然の資質Ⅱ", ["先攻にて失礼"]],
        ["先攻にて失礼", ["チェックメイト"]],
        ["チェックメイト"],
    ],

    "プリム２": [
        ["動じない心Ⅰ", ["必要な体力Ⅰ", "ルークピース"]],
        ["必要な体力Ⅰ", ["動じない心Ⅱ"]],
        ["動じない心Ⅱ", ["必要な体力Ⅱ"]],
        ["必要な体力Ⅱ", ["動じない心Ⅲ"]],
        ["動じない心Ⅲ", ["必要な体力Ⅲ"]],
        ["必要な体力Ⅲ", ["クイーンピース"]],

        ["ルークピース", ["ツークツヴァンク", "耐え忍ぶ時"]],
        ["ツークツヴァンク", ["プロモーション"]],
        ["プロモーション", ["キャスリング"]],
        ["キャスリング", ["確かな読み"]],
        ["確かな読み", ["クイーンピース"]],

        ["耐え忍ぶ時", ["ディスカバード"]],
        ["ディスカバード", ["大胆な一手"]],
        ["大胆な一手", ["クイーンピース"]],
        ["クイーンピース"],
    ],

    "桜悳１": [
        ["一景", ["寂滅Ⅰ", "妙法・雷鼓"]],
        ["寂滅Ⅰ", ["妙法・凩", "妙法・虹"]],
        ["妙法・雷鼓", ["妙法・春雷"]],
        ["妙法・春雷", ["雷の行"]],
        ["雷の行", ["寂滅Ⅱ"]],
        ["寂滅Ⅱ", ["魂の六境"]],

        ["妙法・凩", ["妙法・野分"]],
        ["妙法・野分", ["風の行"]],
        ["風の行", ["寂滅Ⅱ", "無辺の虚空"]],

        ["妙法・虹", ["妙法・眩耀"]],
        ["妙法・眩耀", ["光の行"]],
        ["光の行", ["無辺の虚空"]],
        ["無辺の虚空", ["魂の六境"]],
        ["魂の六境", ["無量神通風解"]],
        ["無量神通風解"],
    ],

    "桜悳２": [
        ["治癒の法力", ["怪異の本覚Ⅰ", "悟りⅠ"]],
        ["怪異の本覚Ⅰ", ["魂衝"]],
        ["魂衝", ["怪異の本覚Ⅱ"]],
        ["怪異の本覚Ⅱ", ["一切皆空"]],
        ["一切皆空", ["怪異の本覚Ⅲ"]],
        ["怪異の本覚Ⅲ", ["大猫解放"]],

        ["悟りⅠ", ["帰依", "片合掌"]],
        ["帰依", ["悟りⅡ"]],
        ["悟りⅡ", ["一来"]],
        ["一来", ["悟りⅢ"]],
        ["悟りⅢ", ["大猫解放"]],

        ["片合掌", ["自然体"]],
        ["自然体", ["大願法術"]],
        ["大願法術", ["大猫解放"]],
        ["大猫解放"],
    ],

    "ウーラ１": [
        ["キュアツール", ["労働力Ⅰ", "パワーサポート"]],
        ["労働力Ⅰ", ["ヒールクラフト"]],
        ["ヒールクラフト", ["労働力Ⅱ"]],
        ["労働力Ⅱ", ["納期直前", "回復工作"]],
        ["納期直前", ["労働力Ⅲ"]],
        ["労働力Ⅲ", ["オーバーワーカー"]],

        ["パワーサポート", ["マジックサポート", "レイズツール"]],
        ["マジックサポート", ["労働万歳"]],
        ["回復工作", ["キュアプラント"]],
        ["キュアプラント", ["オーバーワーカー"]],

        ["レイズツール", ["労働万歳"]],
        ["労働万歳", ["残業"]],
        ["残業", ["レイズプラント"]],
        ["レイズプラント", ["オーバーワーカー"]],
        ["オーバーワーカー"],
    ],

    "ウーラ２": [
        ["ロボットアーム", ["鬱憤解消Ⅰ", "マシンガンセット", "ナチュラライズ"]],
        ["鬱憤解消Ⅰ", ["バブルシューター"]],
        ["バブルシューター", ["鬱憤解消Ⅱ"]],
        ["鬱憤解消Ⅱ", ["オーラグレネード"]],
        ["オーラグレネード", ["鬱憤解消Ⅲ", "道具改造Ⅱ"]],
        ["鬱憤解消Ⅲ", ["ハイパーボンバー"]],

        ["マシンガンセット", ["バトルデプロイ"]],
        ["バトルデプロイ", ["道具改造Ⅰ"]],
        ["道具改造Ⅰ", ["道具改造Ⅱ"]],
        ["道具改造Ⅱ", ["ハイパーボンバー"]],

        ["ナチュラライズ", ["アクセラレーター"]],
        ["アクセラレーター", ["ストレス"]],
        ["ストレス", ["高速処理"]],
        ["高速処理", ["ハイパーボンバー"]],
        ["ハイパーボンバー"],
    ],

    "杖１": [
        ["誘蛾灯渡し", ["狗走Ⅰ", "救命・先手"]],
        ["狗走Ⅰ", ["白紙術"]],
        ["白紙術", ["狗走Ⅱ"]],
        ["狗走Ⅱ", ["朧々幻影"]],
        ["朧々幻影", ["狗走Ⅲ"]],
        ["狗走Ⅲ", ["奥義陽炎"]],

        ["救命・先手", ["救命・後手", "鎧解き"]],
        ["救命・後手", ["刃解き"]],
        ["刃解き", ["空蝉"]],
        ["空蝉", ["救命陣"]],
        ["救命陣", ["奥義陽炎"]],

        ["鎧解き", ["隠し刃Ⅰ"]],
        ["隠し刃Ⅰ", ["隠し刃Ⅱ"]],
        ["隠し刃Ⅱ", ["奥義陽炎"]],
        ["奥義陽炎"],
    ],

    "杖２": [
        ["夜陰襲撃", ["心得Ⅰ", "夜行Ⅰ"]],
        ["心得Ⅰ", ["夜刀・氷牙"]],
        ["夜刀・氷牙", ["心得Ⅱ"]],
        ["心得Ⅱ", ["夜刀・斬月"]],
        ["夜刀・斬月", ["心得Ⅲ"]],
        ["心得Ⅲ", ["百鬼陣"]],

        ["夜行Ⅰ", ["瘴煙", "遁走"]],
        ["瘴煙", ["奇襲"]],
        ["奇襲", ["蛇咬毒牙"]],
        ["蛇咬毒牙", ["夜陰双身"]],
        ["夜陰双身", ["百鬼陣"]],

        ["遁走", ["夜行Ⅱ"]],
        ["夜行Ⅱ", ["深草兎歩"]],
        ["深草兎歩", ["夜陰双身"]],
        ["百鬼陣"],
    ],

    "存子１": [
        ["妖狸玉", ["継承Ⅰ", "怪気練"]],
        ["継承Ⅰ", ["継承Ⅱ"]],
        ["継承Ⅱ", ["怪異行燈"]],
        ["怪異行燈", ["継承Ⅲ"]],
        ["継承Ⅲ", ["隠神顕現"]],

        ["怪気練", ["木の葉吹き", "怪気練練"]],
        ["木の葉吹き", ["つむじ風"]],
        ["つむじ風", ["狸囃子"]],
        ["狸囃子", ["妖狸変化"]],
        ["妖狸変化", ["隠神顕現"]],

        ["怪気練練", ["魔力炸裂Ⅰ"]],
        ["魔力炸裂Ⅰ", ["怪気練練練"]],
        ["怪気練練練", ["妖狸変化", "魔力炸裂Ⅱ"]],
        ["魔力炸裂Ⅱ", ["隠神顕現"]],
        ["隠神顕現"],
    ],

    "存子２": [
        ["ぽんぽこ酔気Ⅰ", ["大きな尻尾Ⅰ", "湧酒瓢箪"]],
        ["大きな尻尾Ⅰ", ["酩酊得々"]],
        ["酩酊得々", ["ぽんぽこ酔気Ⅱ"]],
        ["ぽんぽこ酔気Ⅱ", ["大きな尻尾Ⅱ"]],
        ["大きな尻尾Ⅱ", ["ぽんぽこ酔気Ⅲ"]],
        ["ぽんぽこ酔気Ⅲ", ["怪力乱神"]],

        ["湧酒瓢箪", ["白霧", "狸の宴Ⅰ"]],
        ["白霧", ["瓢箪妖打"]],
        ["瓢箪妖打", ["八八神通力"]],
        ["八八神通力", ["怪力乱神"]],

        ["狸の宴Ⅰ", ["無風Ⅰ"]],
        ["無風Ⅰ", ["無風Ⅱ"]],
        ["無風Ⅱ", ["狸の宴Ⅱ"]],
        ["狸の宴Ⅱ", ["怪力乱神"]],
        ["怪力乱神"],
    ],

    "淡雪１": [
        ["漫ろ雨", ["見極めⅠ", "力の連携"]],
        ["見極めⅠ", ["長期戦略Ⅰ"]],
        ["長期戦略Ⅰ", ["見極めⅡ"]],
        ["見極めⅡ", ["長期戦略Ⅱ"]],
        ["長期戦略Ⅱ", ["秘剣の機"]],

        ["力の連携", ["雪解雨", "冥剣"]],
        ["雪解雨", ["理解"]],
        ["理解", ["一斉攻撃"]],
        ["一斉攻撃", ["秘剣の機"]],

        ["冥剣", ["鈍らせの罠"]],
        ["鈍らせの罠", ["傷狙い"]],
        ["傷狙い", ["秘剣の機"]],

        ["秘剣の機", ["秘剣黒時雨"]],
        ["秘剣黒時雨", ["次ぎ秘剣"]],
        ["次ぎ秘剣"],
    ],

    "淡雪２": [
        ["救護", ["無尽蔵Ⅰ", "熟慮Ⅰ"]],
        ["無尽蔵Ⅰ", ["活性術"]],
        ["活性術", ["無尽蔵Ⅱ"]],
        ["無尽蔵Ⅱ", ["大活性術"]],
        ["大活性術", ["熟慮Ⅲ"]],

        ["熟慮Ⅰ", ["振り太刀", "秘策"]],
        ["振り太刀", ["千切れ雲"]],
        ["千切れ雲", ["反転攻勢"]],
        ["反転攻勢", ["窮地の策"]],

        ["秘策", ["熟慮Ⅱ"]],
        ["熟慮Ⅱ", ["事前の秘策"]],
        ["事前の秘策", ["窮地の策"]],
        ["窮地の策", ["熟慮Ⅲ"]],
        ["熟慮Ⅲ", ["決死行"]],
        ["決死行"],
    ],

    "夕闇１": [
        ["娟々脚", ["継承Ⅰ", "亜魂妙命"]],
        ["継承Ⅰ", ["継承Ⅱ"]],
        ["継承Ⅱ", ["上々Ⅰ"]],
        ["上々Ⅰ", ["継承Ⅲ"]],
        ["継承Ⅲ", ["上々Ⅱ", "魔炎大砲"]],
        ["上々Ⅱ", ["亜魂妙命残火"]],

        ["亜魂妙命", ["魔力炸裂Ⅰ", "夕火"]],
        ["魔力炸裂Ⅰ", ["魔力炸裂Ⅱ"]],
        ["魔力炸裂Ⅱ", ["魔炎大砲"]],
        ["魔炎大砲", ["亜魂妙命残火"]],

        ["夕火", ["夕火退廃"]],
        ["夕火退廃", ["尽きぬ灯火"]],
        ["尽きぬ灯火", ["亜魂妙命真価"]],
        ["亜魂妙命真価", ["亜魂妙命残火"]],
        ["亜魂妙命残火"],
    ],

    "夕闇２": [
        ["妖狐魅了", ["健康体Ⅰ", "夕闇返り"]],
        ["健康体Ⅰ", ["上機嫌"]],
        ["上機嫌", ["健康体Ⅱ"]],
        ["健康体Ⅱ", ["魅了体質"]],
        ["魅了体質", ["艶尾の辻"]],
        ["艶尾の辻", ["五尾炬火"]],

        ["夕闇返り", ["夕闇時Ⅰ", "潤い火"]],
        ["夕闇時Ⅰ", ["包み火"]],
        ["包み火", ["夕闇時Ⅱ"]],
        ["夕闇時Ⅱ", ["五尾炬火"]],

        ["潤い火", ["高嶺の花"]],
        ["高嶺の花", ["潤い火授け"]],
        ["潤い火授け", ["美貌"]],
        ["美貌", ["五尾炬火"]],
        ["五尾炬火"],
    ],
},

// レベルアップによってSPを獲得する場合、レベルごとに得られるSP値を以下の形式で設定します。
// classId: 職業ID, default: デフォルト値, レベル: SP値, レベル: SP値, ...
// 下記の設定例では、レベル2では3SP取得、レベル3では4SP取得、それ以外のレベルでは5SPを獲得します。
levelUpGainSp: [
    {
        classId: 1,
        default: 10,
        2: 2,
    },

    {
        classId: 2,
        default: 10,
        2: 2,
    },

    {
        classId: 3,
        default: 10,
        2: 2,
    },

    {
        classId: 4,
        default: 10,
        2: 2,
    },

    {
        classId: 5,
        default: 10,
        2: 2,
    },

    {
        classId: 6,
        default: 10,
        2: 2,
    },

    {
        classId: 7,
        default: 10,
        2: 2,
    },

    {
        classId: 8,
        default: 10,
        2: 2,
    },
]
// =============================================================
// ●設定項目はここまでです。
// =============================================================
};
};
